In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
database = pd.read_excel("dummy_users.xlsx")
database.head(5)

,id,name,role,salary,age,gender,alive,department,alone,phone_number,city,state,single
0,1,Margaret Moore,Developer,57887,25,Male,No,Operations,No,(254)682-1008x497,Chicago,TX,Yes
1,2,Johnny Mcdowell,Designer,108087,43,Male,No,Finance,No,713.998.3327x6460,Houston,CA,No
2,3,Elizabeth Miller,Manager,68709,42,Female,No,HR,Yes,001-823-068-8392x5295,Los Angeles,CA,Yes
3,4,Lydia Baldwin,Designer,92735,59,Female,No,Operations,No,353-149-4250x81413,Los Angeles,NY,Yes
4,5,John Mccoy,QA,95393,49,Male,No,HR,Yes,(270)652-6399,New York,IL,Yes

In [3]:
database["duplicate"] = database.duplicated()

In [4]:
database.head(5)

,id,name,role,salary,age,gender,alive,department,alone,phone_number,city,state,single,duplicate
0,1,Margaret Moore,Developer,57887,25,Male,No,Operations,No,(254)682-1008x497,Chicago,TX,Yes,False
1,2,Johnny Mcdowell,Designer,108087,43,Male,No,Finance,No,713.998.3327x6460,Houston,CA,No,False
2,3,Elizabeth Miller,Manager,68709,42,Female,No,HR,Yes,001-823-068-8392x5295,Los Angeles,CA,Yes,False
3,4,Lydia Baldwin,Designer,92735,59,Female,No,Operations,No,353-149-4250x81413,Los Angeles,NY,Yes,False
4,5,John Mccoy,QA,95393,49,Male,No,HR,Yes,(270)652-6399,New York,IL,Yes,False

In [7]:
database.shape

(20, 14)

In [5]:
database.drop_duplicates(inplace=True)

In [6]:
database.shape

(20, 14)